[
    {
        "id": "quest_alduin_bane_001",
        "type": "quest",
        "title": "Alduin's Bane",
        "content": "Alduin's Bane is a main story quest in Skyrim. Travel to the Throat of the World, the highest peak in Tamriel. Use the Elder Scroll at the Time Wound to learn the Dragonrend shout from the ancient Nord heroes. This shout forces dragons to land, making them vulnerable. Prerequisites include completing 'The Way of the Voice' and 'Elder Knowledge' quests. Recommended level is 15+. The quest teaches you all three words of Dragonrend instantly. After learning the shout, you'll face Alduin in an epic battle at the summit.",
        "category": "main_quest",
        "level_requirement": 15,
        "prerequisites": [
            "The Way of the Voice",
            "Elder Knowledge"
        ],
        "rewards": [
            "Dragonrend Shout"
        ],
        "location": "Throat of the World"
    },
    {
        "id": "quest_thieves_guild_001",
        "type": "quest",
        "title": "Joining the Thieves Guild",
        "content": "The Thieves Guild is located in the Ratway beneath Riften. To join, speak to Brynjolf in Riften's marketplace during the day. He'll challenge you to prove your skills by framing Brand-Shei. The guild has fallen on hard times and lost Nocturnal's favor. Complete the questline to restore the guild's luck, become Guildmaster, and gain access to the Nightingale armor set. The guild specializes in stealth, lockpicking, and pickpocketing. Key NPCs include Mercer Frey, Karliah, and Vex. No level requirement to join.",
        "category": "faction_quest",
        "level_requirement": 1,
        "prerequisites": [],
        "rewards": [
            "Thieves Guild Membership",
            "Access to Ragged Flagon",
            "Fence Services"
        ],
        "location": "Riften"
    },
    {
        "id": "item_nightingale_armor_001",
        "type": "item",
        "title": "Nightingale Armor Set",
        "content": "The Nightingale Armor is a unique light armor set received during the Thieves Guild questline. The full set includes cuirass, boots, gloves, and hood. At level 32+, the armor provides maximum benefits: 35 armor rating per piece, Fortify Stamina, Frost Resist 50%, and various Fortify skills (Lockpicking +25, Pickpocket +25, Stamina regeneration +100%). The armor scales with your level when received. It's one of the best stealth archer armor sets in the game. Cannot be crafted or improved at workbenches normally. Pairs perfectly with the Nightingale Bow.",
        "category": "armor",
        "weight": 10.0,
        "value": 2000,
        "enchantments": [
            "Fortify Stamina",
            "Frost Resistance",
            "Fortify Lockpicking"
        ],
        "how_to_obtain": "Complete 'Trinity Restored' quest in Thieves Guild questline"
    },
    {
        "id": "item_dawnbreaker_001",
        "type": "item",
        "title": "Dawnbreaker",
        "content": "Dawnbreaker is a unique one-handed sword obtained from Meridia's Daedric quest 'The Break of Dawn'. It deals 12 base damage plus 10-15 fire damage to undead. Has a chance to cause a fiery explosion that turns and/or destroys nearby undead. Weighs 10 units, valued at 740 gold. The sword is particularly effective against Draugr, vampires, and dragon priests. To start the quest, find Meridia's Beacon in any dungeon chest after level 12, then take it to the Statue to Meridia west of Solitude. The quest involves clearing Kilkreath Temple of Malkoran and his shades.",
        "category": "weapon",
        "weapon_type": "one_handed_sword",
        "base_damage": 12,
        "weight": 10.0,
        "value": 740,
        "enchantments": [
            "Burns undead",
            "Explosion effect"
        ],
        "how_to_obtain": "Complete Meridia's quest 'The Break of Dawn'"
    },
    {
        "id": "npc_paarthurnax_001",
        "type": "npc",
        "title": "Paarthurnax",
        "content": "Paarthurnax is an ancient dragon who serves as the leader of the Greybeards. He resides at the peak of the Throat of the World. Once Alduin's lieutenant, he betrayed the dragons to help humans learn the Thu'um. He is meditative, philosophical, and struggles daily with his dragon nature to dominate. Teaches you the Fire Breath shout and the final word of Fus Ro Dah. Famous quote: 'What is better - to be born good, or to overcome your evil nature through great effort?' The Blades will ask you to kill him, creating a moral dilemma. Voiced by Charles Martinet (Mario).",
        "category": "character",
        "faction": "Greybeards",
        "location": "Throat of the World",
        "voice_actor": "Charles Martinet",
        "teaches": [
            "Fire Breath",
            "Fus Ro Dah (3rd word)"
        ]
    },
    {
        "id": "npc_lydia_001",
        "type": "npc",
        "title": "Lydia",
        "content": "Lydia is a Nord housecarl appointed to serve the Thane of Whiterun. She becomes your follower after completing 'Dragon Rising' and purchasing Breezehome. Famous for her unenthusiastic line 'I am sworn to carry your burdens.' She's a one-handed warrior who specializes in heavy armor. Maximum level is 50. Can be married after completing the Temple of Mara quest. Essential until you marry her or complete the main quest. Good for tanking damage in early game. Often gets in your way during dungeon crawling, a common source of player frustration.",
        "category": "character",
        "role": "housecarl",
        "location": "Dragonsreach, Whiterun",
        "combat_style": "One-handed + Heavy Armor",
        "max_level": 50,
        "marriage": true
    },
    {
        "id": "alchemy_invisibility_001",
        "type": "alchemy",
        "title": "Invisibility Potion Recipe",
        "content": "Invisibility potions make you completely invisible for 30-60 seconds depending on alchemy skill. Useful for stealth characters to escape combat or sneak past enemies. Recipe requires two of these ingredients: Chaurus Eggs, Crimson Nirnroot, Ice Wraith Teeth, Luna Moth Wing, Nirnroot, Vampire Dust. Most common combination is Chaurus Eggs + Luna Moth Wing. Chaurus eggs found in Falmer caves. Luna Moth Wings caught at night near water. At Alchemy 100 with perks, potions last over 60 seconds. Stacks with Muffle enchantment for ultimate stealth.",
        "category": "potion",
        "effect": "Invisibility",
        "ingredients": [
            "Chaurus Eggs",
            "Luna Moth Wing",
            "Ice Wraith Teeth",
            "Nirnroot",
            "Vampire Dust"
        ],
        "duration_base": 30,
        "recommended_for": [
            "Stealth builds",
            "Thieves Guild quests"
        ]
    },
    {
        "id": "shout_dragonrend_001",
        "type": "shout",
        "title": "Dragonrend (Joor Zah Frul)",
        "content": "Dragonrend is a unique shout that forces dragons to land and drains their stamina. The three words mean 'Mortal', 'Finite', and 'Temporary'. You learn all three words instantly during the quest 'Alduin's Bane' from the spirits of ancient Nord heroes. Unlike other shouts, it cannot be learned from word walls. Effects last 12 seconds per word (36 seconds total). Essential for fighting Alduin and other aerial dragons. Cooldown is 10/15/20 seconds per word used. The shout embodies the concept of mortality, which dragons cannot truly understand, causing them psychic pain.",
        "category": "shout",
        "words": [
            "Joor",
            "Zah",
            "Frul"
        ],
        "translation": [
            "Mortal",
            "Finite",
            "Temporary"
        ],
        "effect": "Forces dragons to land",
        "cooldown": "10/15/20 seconds",
        "how_to_learn": "Story quest 'Alduin's Bane' only"
    },
    {
        "id": "lore_dark_brotherhood_001",
        "type": "lore",
        "title": "The Dark Brotherhood",
        "content": "The Dark Brotherhood is an ancient guild of assassins who worship the Dread Father Sithis and his bride, the Night Mother. Members follow the Five Tenets: obey the Night Mother, never dishonor the Brotherhood, never disobey a superior, never steal from a Brotherhood member, and never kill a Brotherhood member. The sanctuary in Skyrim is located near Falkreath. To join, complete the innocence quest 'Innocence Lost' in Windhelm by killing Grelod the Kind, then sleep. Astrid will kidnap you. The questline involves contracts, betrayal, and ultimately becoming Listener. The phrase 'What is the music of life?' with answer 'Silence, my brother' is their greeting.",
        "category": "faction",
        "deity": "Sithis",
        "leader": "Night Mother / Astrid",
        "location": "Dark Brotherhood Sanctuary, Falkreath Hold",
        "how_to_join": "Complete 'Innocence Lost' quest, then sleep"
    },
    {
        "id": "lore_dwemer_001",
        "type": "lore",
        "title": "The Dwemer (Dwarves)",
        "content": "The Dwemer, also called Deep Elves or Dwarves, were an ancient race of elves who disappeared mysteriously in the First Era. Despite the name, they were not short. They were master engineers and metallurgists who created complex animunculi (robots), advanced machinery, and architectural marvels. Their ruins are filled with steam-powered traps, centurions, spheres, and spiders. They disappeared instantly during the Battle of Red Mountain when their chief Tonal Architect Kagrenac struck the Heart of Lorkhan with Keening. Only one Dwemer, Yagrum Bagarn, survived because he was in another dimension. Dwemer artifacts and metal are highly valuable.",
        "category": "history",
        "race": "Mer (Elves)",
        "era": "First Era",
        "known_for": [
            "Engineering",
            "Animunculi",
            "Mysterious disappearance"
        ],
        "related_locations": [
            "Blackreach",
            "Markarth",
            "Dwemer Ruins"
        ]
    },
    {
        "id": "enemy_dragon_priest_001",
        "type": "enemy",
        "title": "Dragon Priest Strategy",
        "content": "Dragon Priests are powerful undead spellcasters who served dragons in ancient times. Each wears a unique mask with special enchantments. They are resistant to frost (50-75%) and use powerful destruction magic, primarily fire and lightning. Combat strategy: Maintain distance, use fire resistance potions/enchantments, equip magic resistance gear (80%+ recommended). The Spellbreaker shield blocks spells effectively. Mark for Death shout reduces their armor. They can teleport and summon Draugr. Avoid fighting in enclosed spaces. Recommended level 30+. Each mask provides unique bonuses - Morokei gives +100% magicka regen, Krosis gives +20% to Lockpicking/Archery/Alchemy. There are 14 masks total including Konahrik.",
        "category": "enemy",
        "difficulty": "Very Hard",
        "resistances": [
            "Frost 50-75%",
            "Poison Immune"
        ],
        "weaknesses": [
            "Fire damage"
        ],
        "recommended_level": 30,
        "drops": [
            "Dragon Priest Mask",
            "Soul Gems",
            "Ebony Weapons"
        ]
    },
    {
        "id": "build_stealth_archer_001",
        "type": "build",
        "title": "Stealth Archer Build Guide",
        "content": "The Stealth Archer is one of the most powerful builds in Skyrim. Key skills: Archery (primary), Sneak (primary), Light Armor, Alchemy, Enchanting. Perks: Stealth 5/5, Deadly Aim, Overdraw 5/5, Critical Shot, Quick Shot. Armor: Nightingale set or Krosis mask + Ancient Shrouded cowl. Weapons: Nightingale Bow or Auriel's Bow. Enchantments: Fortify Archery on helm, gloves, ring, necklace (160% total damage boost). Craft Fortify Archery potions (Canis Root + Juniper Berries). Strategy: sneak, shoot, sneak back, repeat. At high levels you'll one-shot most enemies with 3x sneak attack bow damage. Join Thieves Guild and Dark Brotherhood for gear. Stone: Thief Stone early, Shadow Stone late game.",
        "category": "character_build",
        "primary_skills": [
            "Archery",
            "Sneak"
        ],
        "secondary_skills": [
            "Light Armor",
            "Alchemy",
            "Enchanting"
        ],
        "recommended_race": "Bosmer (Wood Elf) or Khajiit",
        "difficulty": "Easy to Master"
    }
]